CSI API ETABS v1

# cStory Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cStory

    Public Interface cStory

    Dim instance As cStory

    public interface class cStory

    type cStory =  interface end

The cStory type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetElevation|  Retrieves the
elevation of a defined story
|
GetGUID|  Retrieves the GUID of a
defined story
|
GetHeight|  Retrieves the height
of a defined story
|
GetMasterStory|  Retrieves whether
a defined story is a master story
|
GetNameList|  Retrieves the names
of all defined stories
|
GetSimilarTo|  Retrieves whether a
story is a master story, and if not, which master story it is similar to
|
GetSplice|  Retrieves the story
splice height, if applicable
|
GetStories|  This function is
DEPRECATED. Please refer to GetStories_2(Double, Int32, String, Double,
Double, Boolean, String, Boolean, Double,
Int32) Retrieves the story
information for the current tower
|
GetStories_2|  Retrieves the story
information for the current tower. This function supersedes GetStories
|
SetElevation|  Sets the elevation
of a defined story
| [SetGUID](e8b8f661-42dd-
fb00-9595-4dcc09f4c938.htm)|  Sets the GUID of a defined story
|
SetHeight|  Sets the height of a
defined story
|
SetMasterStory|  Sets whether a
defined story is a master story
|
SetSimilarTo|  Sets the master
story that a defined story should be similar to
|
SetSplice|  Sets the splice height
of a defined story
|
SetStories|  This function is
DEPRECATED. Please refer to SetStories_2(Double, Int32, String, Double,
Boolean, String, Boolean, Double,
Int32) Sets the stories for the
current tower
|
SetStories_2|  Sets the stories
for the current tower. This function supersedes SetStories. Note: this
function can only be used when no objects exist in the model.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com